<?php

if (!defined('AKM_LOADED')) {
    die('Direct access to this file is not allowed.');
}

$lang['mod_faq_mod'] = [
    'list' => 'لیستی مۆدیۆلەکانی پرسیارەکان',
    'add' => 'مۆدیۆلی پرسیارەکان زیاد بکە',
    'edit' => 'مۆدیۆلی پرسیارەکان دەستکاری بکە',
    'information' => 'زانیاری',
    'success' => 'سەرکەوتوو',
    'error' => 'هەڵە ڕوویدا',
    'remove_record' => 'ئایا دڵنیایت دەتەوێت ئەم تۆمارە بسڕیتەوە؟',
    'message' => [
        'success' => [
            'add' => 'مۆدیۆلی پرسیارەکان بە سەرکەوتوویی زیادکرا!',
            'edit' => 'مۆدیۆلی پرسیارەکان بە سەرکەوتوویی نوێکرایەوە!',
            'delete' => 'مۆدیۆلی پرسیارەکان بە سەرکەوتوویی سڕایەوە!',
        ],
        'error' => [
            'add' => 'زیادکردنی مۆدیۆلی پرسیارەکان سەرکەوتوو نەبوو!',
            'edit' => 'نوێکردنەوەی مۆدیۆلی پرسیارەکان سەرکەوتوو نەبوو!',
        ],
    ],
    'errors' => [
        'record' => 'تۆماری دیاریکراو نەدۆزرایەوە!',
    ],
    'button' => [
        'add' => 'زیاد بکە',
        'edit' => 'دەستکاری بکە',
        'delete' => 'بسڕەوە',
        'refresh' => 'نوێ بکەرەوە',
        'cancel' => 'هەڵوەشاندنەوە',
        'remove' => 'لابردن',
        'yes' => 'بەڵێ',
        'no' => 'نەخێر',
    ],
    'validator' => [
        'required' => 'تکایە خانەی %s بە بەتاڵی جێمەهێڵە',
        'length' => 'دەبێت %s لە نێوان %s و %s پیتدا بێت',
        'unique' => '%s کە نووسیوتە پێشتر لە سیستەمدا تۆمار کراوە. تکایە %سێکی تر دیاری بکە!',
    ],
    'role' => [
        'name' => 'ڕۆڵەکانی بەڕێوەبردنی مۆدیۆلەکانی پرسیارەکان',
        'add' => 'دەتوانێت مۆدیۆلی پرسیارەکان زیاد بکات',
        'edit' => 'دەتوانێت مۆدیۆلی پرسیارەکان دەستکاری بکات',
        'delete' => 'دەتوانێت مۆدیۆلی پرسیارەکان بسڕێتەوە',
        'list' => 'دەتوانێت بەڕێوەبردنی مۆدیۆلەکانی پرسیارەکان ببینێت',
        'moderate_edit' => 'دەتوانێت تۆمارەکانی کەسانی تر دەستکاری بکات',
        'moderate_delete' => 'دەتوانێت تۆمارەکانی کەسانی تر بسڕێتەوە',
    ],
    'role_errors' => [
        'moderate_edit' => 'مۆڵەتی دەستکاریکردنی تۆماری کەسانی ترت نییە',
        'moderate_delete' => 'مۆڵەتی سڕینەوەی تۆماری کەسانی ترت نییە',
        'add' => 'مۆڵەتی زیادکردنی مۆدیۆلی پرسیارەکانت نییە',
        'edit' => 'مۆڵەتی دەستکاریکردنی مۆدیۆلی پرسیارەکانت نییە',
        'list' => 'مۆڵەتی بینینی بەڕێوەبردنی مۆدیۆلەکانی پرسیارەکانت نییە',
        'delete' => 'مۆڵەتی سڕینەوەی مۆدیۆلی پرسیارەکانت نییە',
    ],
    'admin' => [
        'columns' => [
            'id' => 'ناسنامە',
            'name' => 'ناوی مۆدیۆلی پرسیارەکان',
            'mod_name' => 'ناوی مۆدیۆل',
            'mod_key' => 'کلیلی مۆدیۆل (ID)',
            'mod_value' => 'بەهای مۆدیۆل (ناونیشان)',
        ],
    ],
];
